### Q1. List any five functions of the pandas library with execution.

1. read_csv()
2. head()
3. tail()
4. describe()
5. loc()

In [2]:
import pandas as pd

df = pd.read_csv("../../datasets/nba.csv")
df.head()

,Unnamed: 0,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,0,1,Álex Abrines,SG,24,OKC,75,8,1134,115,...,.848,26,88,114,28,38,8,25,124,353
1,1,2,Quincy Acy,PF,27,BRK,70,8,1359,130,...,.817,40,217,257,57,33,29,60,149,411
2,2,3,Steven Adams,C,24,OKC,76,76,2487,448,...,.559,384,301,685,88,92,78,128,215,1056
3,3,4,Bam Adebayo,C,20,MIA,69,19,1368,174,...,.721,118,263,381,101,32,41,66,138,477
4,4,5,Arron Afflalo,SG,32,ORL,53,3,682,65,...,.846,4,62,66,30,4,9,21,56,179

In [3]:
df.tail()

,Unnamed: 0,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
685,685,537,Tyler Zeller,C,28,BRK,42,33,703,125,...,.667,63,131,194,28,8,21,35,78,300
686,686,537,Tyler Zeller,C,28,MIL,24,1,406,62,...,.895,47,64,111,19,7,14,12,48,141
687,687,538,Paul Zipser,SF,23,CHI,54,12,824,81,...,.760,13,118,131,46,20,15,43,86,218
688,688,539,Ante Žižić,C,21,CLE,32,2,214,49,...,.724,24,36,60,5,2,13,11,30,119
689,689,540,Ivica Zubac,C,20,LAL,43,0,410,61,...,.765,45,78,123,25,8,15,26,47,161

In [4]:
df.describe()

       Unnamed: 0
count  690.000000
mean   344.500000
std    199.330128
min      0.000000
25%    172.250000
50%    344.500000
75%    516.750000
max    689.000000

In [5]:
df.loc[2:6]

,Unnamed: 0,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
2,2,3,Steven Adams,C,24,OKC,76,76,2487,448,...,.559,384,301,685,88,92,78,128,215,1056
3,3,4,Bam Adebayo,C,20,MIA,69,19,1368,174,...,.721,118,263,381,101,32,41,66,138,477
4,4,5,Arron Afflalo,SG,32,ORL,53,3,682,65,...,.846,4,62,66,30,4,9,21,56,179
5,5,6,Cole Aldrich,C,29,MIN,21,0,49,5,...,.333,3,12,15,3,2,1,1,11,12
6,6,7,LaMarcus Aldridge,C,32,SAS,75,75,2509,687,...,.837,246,389,635,152,43,90,111,161,1735

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
data = {"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]}

df = pd.DataFrame(data=data)
# df.head()
index = pd.Series([i for i in range(3)])

df_new = df.set_index([index, index+2])
df_new.head()

     A  B  C
0 2  1  4  7
1 3  2  5  8
2 4  3  6  9

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [42]:
data = {"Values": [10, 20, 30, 40, 50, 60]}

df = pd.DataFrame(data=data)
# df.head()

total_list = [i for i in df.iloc[0:3]['Values']]

print(__builtins__.sum(total_list))

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [60]:
data = {"Text": ['Jack', 'James', 'Jennifer', 'Jackson', 'Julia', ]}

df = pd.DataFrame(data=data)
# df.head()
# print(len(df))
# print(len(df['Text'][0]))

word_count_list = [len(text) for text in df['Text']]
for i in word_count_list:
    print(i)

df['Word_Count'] = word_count_list
df.head()

4
5
8
7
5

       Text  Word_Count
0      Jack           4
1     James           5
2  Jennifer           8
3   Jackson           7
4     Julia           5

### Q5. How are DataFrame.size() and DataFrame.shape() different?

|DataFrame.size()|DataFrame.shape()|
|-|-|
|Return an int representing the number of elements in this object.|Return a tuple representing the dimensionality of the DataFrame.|
|Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.|shape returns a tuple with two integers. The first is the number of rows and the second is the number of columns.|

### Q6. Which function of pandas do we use to read an excel file?

- We use "pd.read_excel()" function to read excel file.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [65]:
data = {"Email": ['Jack@example.com', 'James@example.com',
                  'Jennifer@example.com', 'Jackson@example.com', 'Julia@example.com']}

df = pd.DataFrame(data=data)
df.head()

username_list = [text.split("@")[0] for text in df['Email']]

df['Username'] = username_list
df.head()

                  Email  Username
0      Jack@example.com      Jack
1     James@example.com     James
2  Jennifer@example.com  Jennifer
3   Jackson@example.com   Jackson
4     Julia@example.com     Julia

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [75]:
data = {"A": [3, 8, 6, 2, 9], "B": [5, 2, 9, 3, 1], "C": [1, 7, 4, 5, 2]}

df = pd.DataFrame(data=data)
df.head()

df_new = df[(df['A'] > 5) & (df['B'] < 10)]

print(type(df_new))

df_new.head()

<class 'pandas.core.frame.DataFrame'>

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [86]:
import statistics

data = {"Values": [10, 20, 30, 40, 50, 60]}

df = pd.DataFrame(data=data)
# df.head()
mean = 0


def cal_mean(df):
    mean = statistics.mean(list(df['Values']))
    return mean


median = 0


def cal_median(df):
    median = statistics.median(list(df['Values']))
    return median


sd = 0


def cal_sd(df):
    sd = statistics.stdev(list(df['Values']))
    return sd


mean = cal_mean(df)
median = cal_median(df)
sd = cal_sd(df)
print(f"Mean: {mean}")
print(f"Median: {median}")
print(f"Standard Deviation: {sd}")

Mean: 35
Median: 35.0
Standard Deviation: 18.708286933869708

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [114]:
from datetime import date

data = {"Sales": [3000, 8000, 6000, 2000, 9000, 1000, 4000, 7000,5000,3000,4500,5700,9500,6500,3500], "Date": [
    "2023-07-07", "2023-07-08", "2023-07-09", "2023-07-10", "2023-07-11", "2023-07-12", "2023-07-13", "2023-07-14","2023-07-15","2023-07-16","2023-07-17","2023-07-18","2023-07-19","2023-07-20","2023-07-21"]}

df = pd.DataFrame(data=data)
df.head()
#print(type(df['Sales']))
def moving_average(df):
    windows = df['Sales'].rolling(7)
    mean_list = windows.mean()
    df['MovingAverage'] = mean_list

    return df

moving_average(df)

    Sales        Date  MovingAverage
0    3000  2023-07-07            NaN
1    8000  2023-07-08            NaN
2    6000  2023-07-09            NaN
3    2000  2023-07-10            NaN
4    9000  2023-07-11            NaN
5    1000  2023-07-12            NaN
6    4000  2023-07-13    4714.285714
7    7000  2023-07-14    5285.714286
8    5000  2023-07-15    4857.142857
9    3000  2023-07-16    4428.571429
10   4500  2023-07-17    4785.714286
11   5700  2023-07-18    4314.285714
12   9500  2023-07-19    5528.571429
13   6500  2023-07-20    5885.714286
14   3500  2023-07-21    5385.714286

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [93]:
from datetime import datetime

data = {"Date": [
    "2023-07-07", "2023-07-17", "2023-07-27", "2023-07-28", "2023-07-29", "2023-08-01", "2023-08-04", "2023-08-07"]}

df = pd.DataFrame(data=data)
df.head()


def cal_weekday(df):
    weekday_list = [datetime.strptime(
        week_day, '%Y-%m-%d').date().strftime('%A') for week_day in df['Date']]

    df['Weekday'] = weekday_list
    return df


cal_weekday(df)

         Date   Weekday
0  2023-07-07    Friday
1  2023-07-17    Monday
2  2023-07-27  Thursday
3  2023-07-28    Friday
4  2023-07-29  Saturday
5  2023-08-01   Tuesday
6  2023-08-04    Friday
7  2023-08-07    Monday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [104]:
data = {"Date": [
    "2023-01-07", "2022-02-17", "2023-01-27", "2023-03-28", "2023-04-29", "2023-01-01", "2022-05-04", "2023-01-07"]}

df = pd.DataFrame(data=data)
df.head()


def query_date_between(df):

    df = df[(df['Date'] >= "2023-01-01") & (df['Date'] <= "2023-01-31")]
    return df


query_date_between(df)

         Date
0  2023-01-07
2  2023-01-27
5  2023-01-01
7  2023-01-07

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

- pandas library needs to be imported.